Repository: 970970970/mobile
Catalog: ios/boycott/boycott/Resources/*.lproj/Localizable.strings
Languages: bn, fa, hi, ur

source: Language Settings
bn: ভাষা সেটিংস
fa: تنظیمات زبان
hi: भाषा सेटिंग्स
ur: زبان کی ترتیبات

source: Current Language
bn: বর্তমান ভাষা
fa: زبان فعلی
hi: वर्तमान भाषा
ur: موجودہ زبان

source: Theme Settings
bn: থিম সেটিংস
fa: تنظیمات ظاهری
hi: थीम सेटिंग्स
ur: تھیم کی ترتیبات

source: Dark Mode
bn: ডার্ক মোড
fa: حالت تاریک
hi: डार्क मोड
ur: ڈارک موڈ

source: Cache Management
bn: ক্যাশে ব্যবস্থাপনা
fa: مدیریت حافظه پنهان
hi: कैश प्रबंधन
ur: کیشے مینجمنٹ

source: Clear Cache
bn: ক্যাশে মুছুন
fa: پاک کردن حافظه پنهان
hi: कैश साफ़ करें
ur: کیشے صاف کریں

source: Calculating...
bn: হিসাব করা হচ্ছে...
fa: در حال محاسبه...
hi: गणना हो रही है...
ur: حساب کر رہا ہے...

source: Version
bn: সংস্করণ
fa: نسخه
hi: संस्करण
ur: ورژن

source: Scan
bn: স্ক্যান
fa: اسکن
hi: स्कैन
ur: اسکین

source: Feedback & Support
bn: প্রতিক্রিয়া ও সহায়তা
fa: بازخورد و پشتیبانی
hi: फीडबैक और सहायता
ur: رائے اور مدد

source: Submit Feedback
bn: প্রতিক্রিয়া জমা দিন
fa: ارسال بازخورد
hi: फीडबैक भेजें
ur: رائے جمع کریں

source: Community Discussion
bn: কমিউনিটি আলোচনা
fa: گفتگوی انجمن
hi: समुदाय चर्चा
ur: کمیونٹی ڈسکشن

source: Support Us
bn: আমাদের সমর্থন করুন
fa: حمایت از ما
hi: हमारा समर्थन करें
ur: ہماری مدد کریں

source: About
bn: সম্পর্কে
fa: درباره
hi: हमारे बारे में
ur: ہمارے بارے میں

source: Privacy Policy
bn: গোপনীয়তা নীতি
fa: سیاست حفظ حریم خصوصی
hi: गोपनीयता नीति
ur: رازداری کی پالیسی

source: Terms of Service
bn: পরিষেবার শর্তাবলী
fa: شرایط خدمات
hi: सेवा की शर्तें
ur: سروس کی شرائط

source: Cancel
bn: বাতিল
fa: لغو
hi: रद्द करें
ur: منسوخ کریں

source: Confirm
bn: নিশ্চিত করুন
fa: تایید
hi: पुष्टि करें
ur: تصدیق کریں

source: Done
bn: সম্পন্ন
fa: انجام شد
hi: हो गया
ur: مکمل

# clear_cache_confirm
source: Are you sure you want to clear all cache?
bn: আপনি কি নিশ্চিত যে আপনি সমস্ত ক্যাশে মুছে ফেলতে চান?
fa: آیا مطمئن هستید که می‌خواهید تمام حافظه پنهان را پاک کنید؟
hi: क्या आप वाकई सभी कैश साफ़ करना चाहते हैं?
ur: کیا آپ واقعی تمام کیشے صاف کرنا چاہتے ہیں؟

source: Select Language
bn: ভাষা নির্বাচন করুন
fa: انتخاب زبان
hi: भाषा चुनें
ur: زبان منتخب کریں

# search_placeholder
source: Search company name
bn: কোম্পানি খুঁজুন
fa: جستجوی شرکت
hi: कंपनी खोजें
ur: کمپنی کا نام تلاش کریں

source: No articles
bn: কোন নিবন্ধ নেই
fa: مقاله‌ای موجود نیست
hi: कोई लेख नहीं
ur: کوئی مضامین نہیں

# nav_home
source: Home
bn: হোম
fa: خانه
hi: होम
ur: ہوم

# nav_brands
source: Brands
bn: ব্র্যান্ড
fa: برندها
hi: ब्रांड्स
ur: برانڈز

# nav_scan
source: Scan
bn: স্ক্যান
fa: اسکن
hi: स्कैन
ur: اسکین

# nav_articles
source: Articles
bn: নিবন্ধ
fa: مقالات
hi: लेख
ur: مضامین

# nav_settings
source: Settings
bn: সেটিংস
fa: تنظیمات
hi: सेटिंग्स
ur: ترتیبات

# settings_language
source: Language Settings
bn: ভাষা
fa: زبان
hi: भाषा
ur: زبان کی ترتیبات

# settings_dark_mode
source: Dark Mode
bn: ডার্ক মোড
fa: حالت تاریک
hi: डार्क मोड
ur: ڈارک موڈ

# settings_cache
source: Clear Cache
bn: ক্যাশে পরিষ্কার করুন
fa: پاک کردن حافظه پنهان
hi: कैश साफ़ करें
ur: کیشے صاف کریں

# settings_feedback_support
source: Feedback & Support
bn: প্রতিক্রিয়া ও সহায়তা
fa: بازخورد و پشتیبانی
hi: फीडबैक और सहायता
ur: رائے اور مدد

# settings_submit_feedback
source: Submit Feedback
bn: প্রতিক্রিয়া জমা দিন
fa: ارسال بازخورد
hi: फीडबैक भेजें
ur: رائے جمع کریں

# settings_community
source: Community Discussions
bn: কমিউনিটি
fa: انجمن
hi: समुदाय
ur: کمیونٹی ڈسکشن

# settings_donate
source: Support Us
bn: আমাদের সমর্থন করুন
fa: حمایت از ما
hi: हमारा समर्थन करें
ur: ہماری مدد کریں

# settings_about
source: About
bn: সম্পর্কে
fa: درباره
hi: हमारे बारे में
ur: ہمارے بارے میں

# settings_version
source: Version
bn: সংস্করণ
fa: نسخه
hi: संस्करण
ur: ورژن

# settings_privacy
source: Privacy Policy
bn: গোপনীয়তা নীতি
fa: سیاست حفظ حریم خصوصی
hi: गोपनीयता नीति
ur: رازداری کی پالیسی

# settings_agreement
source: User Agreement
bn: ব্যবহারকারী চুক্তি
fa: شرایط خدمات
hi: उपयोगकर्ता समझौता
ur: صارف معاہدہ

# settings_basic
source: Basic Settings
bn: মৌলিক সেটিংস
fa: تنظیمات پایه
hi: बुनियादी सेटिंग्स
ur: بنیادی ترتیبات

# settings_legal
source: Legal Terms
bn: আইনি
fa: قانونی
hi: कानूनी
ur: قانونی

# settings_privacy_policy
source: Privacy Policy
bn: গোপনীয়তা নীতি
fa: سیاست حفظ حریم خصوصی
hi: गोपनीयता नीति
ur: رازداری کی پالیسی

# settings_user_agreement
source: User Agreement
bn: ব্যবহারকারী চুক্তি
fa: توافقنامه کاربر
hi: उपयोगकर्ता समझौता
ur: صارف معاہدہ

# settings_unknown_version
source: Unknown Version
bn: অজানা সংস্করণ
fa: نسخه نامشخص
hi: अज्ञात संस्करण
ur: نامعلوم ورژن

# settings_select_language
source: Select Language
bn: ভাষা নির্বাচন করুন
fa: انتخاب زبان
hi: भाषा चुनें
ur: زبان منتخب کریں

# settings_close
source: Close
bn: বন্ধ করুন
fa: بستن
hi: बंद करें
ur: بند کریں

# settings_loading
source: Loading...
bn: লোড হচ্ছে...
fa: در حال بارگذاری...
hi: लोड हो रहा है...
ur: لوڈ ہو رہا ہے...

# settings_error
source: Load Failed
bn: লোড করতে ব্যর্থ
fa: خطا در بارگذاری
hi: लोड करने में विफल
ur: لوڈ کرنے میں ناکام

# feedback_title
source: Submit Feedback
bn: প্রতিক্রিয়া জমা দিন
fa: ارسال بازخورد
hi: फीडबैक भेजें
ur: رائے جمع کریں

source: Feedback Type
bn: প্রতিক্রিয়ার ধরন
fa: نوع بازخورد
hi: फीडबैक का प्रकार
ur: رائے کی قسم

source: Feedback Content
bn: বিষয়বস্তু
fa: محتوا
hi: सामग्री
ur: مواد

# feedback_contact
source: Contact Information (Optional)
bn: যোগাযোগ (ঐচ্ছিক)
fa: اطلاعات تماس (اختیاری)
hi: संपर्क जानकारी (वैकल्पिक)
ur: رابطہ (اختیاری)

# feedback_submit
source: Submit
bn: জমা দিন
fa: ارسال
hi: भेजें
ur: جمع کریں

# feedback_cancel
source: Cancel
bn: বাতিল করুন
fa: لغو
hi: रद्द करें
ur: منسوخ کریں

# feedback_type_issue
source: Issue Feedback
bn: সমস্যা রিপোর্ট করুন
fa: گزارش مشکل
hi: समस्या की रिपोर्ट करें
ur: مسئلہ رپورٹ کریں

# feedback_type_feature
source: Feature Suggestion
bn: ফিচার অনুরোধ
fa: درخواست ویژگی
hi: सुविधा का अनुरोध
ur: فیچر کی درخواست

# feedback_type_data
source: Data Correction
bn: ডেটা সংশোধন
fa: اصلاح داده
hi: डेटा सुधार
ur: ڈیٹا کی درستگی

# feedback_type_other
source: Other
bn: অন্যান্য
fa: سایر
hi: अन्य
ur: دیگر

# search_title
source: Search
bn: অনুসন্ধান
fa: جستجو
hi: खोज
ur: تلاش

# search_hint
source: Search for Brands
bn: ব্র্যান্ড অনুসন্ধান করুন
fa: جستجوی برند
hi: ब्रांड खोजें
ur: برانڈ تلاش کریں

# search_scan
source: Scan Barcode
bn: কোড স্ক্যান করুন
fa: اسکن کد
hi: कोड स्कैन करें
ur: بارکوڈ اسکین کریں

# search_camera
source: Take Photo
bn: ক্যামেরা
fa: دوربین
hi: कैमरा
ur: تصویر لیں

# search_button
source: Search
bn: অনুসন্ধান
fa: جستجو
hi: खोजें
ur: تلاش کریں

source: Search History
bn: অনুসন্ধান ইতিহাস
fa: تاریخچه جستجو
hi: खोज इतिहास
ur: تلاش کی ہسٹری

source: Search Results
bn: অনুসন্ধান ফলাফল
fa: نتایج جستجو
hi: खोज परिणाम
ur: تلاش کے نتائج

source: Clear History
bn: ইতিহাস মুছুন
fa: پاک کردن تاریخچه
hi: इतिहास साफ़ करें
ur: ہسٹری صاف کریں

# status_avoid
source: Avoid
bn: বয়কট
fa: تحریم
hi: बहिष्कार
ur: بائیکاٹ

# status_support
source: Support
bn: সমর্থন
fa: حمایت
hi: समर्थन
ur: حمایت

# status_neutral
source: Neutral
bn: নিরপেক্ষ
fa: خنثی
hi: तटस्थ
ur: غیر جانبدار

# action_back
source: Back
bn: পিছনে
fa: بازگشت
hi: वापस
ur: واپس

# action_feedback
source: Feedback
bn: প্রতিক্রিয়া
fa: بازخورد
hi: फीडबैक
ur: رائے

# action_share
source: Share
bn: শেয়ার করুন
fa: اشتراک‌گذاری
hi: साझा करें
ur: شیئر کریں

# action_share_article
source: Share Article
bn: নিবন্ধ শেয়ার করুন
fa: اشتراک‌گذاری مقاله
hi: लेख साझा करें
ur: مضمون شیئر کریں

# action_clear
source: Clear
bn: পরিষ্কার করুন
fa: پاک کردن
hi: साफ़ करें
ur: صاف کریں

# action_delete
source: Delete
bn: মুছুন
fa: حذف
hi: हटाएं
ur: حذف کریں

# article_detail_title
source: Article Details
bn: নিবন্ধের বিস্তারিত
fa: جزئیات مقاله
hi: लेख विवरण
ur: مضمون کی تفصیلات

# article_publish_time
source: Publish Time:
bn: প্রকাশিত:
fa: تاریخ انتشار:
hi: प्रकाशित:
ur: اشاعت کا وقت:

# article_summary
source: Summary
bn: সারাংশ
fa: خلاصه
hi: सारांश
ur: خلاصہ

# article_image_desc
source: Article Image: %1$s
bn: নিবন্ধের ছবি: %@
fa: تصویر مقاله: %@
hi: लेख छवि: %@
ur: مضمون کی تصویر: %1$s

# article_loading
source: Loading...
bn: লোড হচ্ছে...
fa: در حال بارگذاری...
hi: लोड हो रहा है...
ur: لوڈ ہو رہا ہے...

# article_error
source: Load Failed
bn: লোড করতে ব্যর্থ
fa: خطا در بارگذاری
hi: लोड करने में विफल
ur: لوڈ کرنے میں ناکام

# translation_warning_zh
source: This article is translated by AI and may contain inaccuracies
bn: এই নিবন্ধটি AI দ্বারা অনুবাদ করা হয়েছে এবং অনির্ভুলতা থাকতে পারে
fa: این مقاله توسط هوش مصنوعی ترجمه شده و ممکن است دقیق نباشد
hi: यह लेख AI द्वारा अनुवादित है और इसमें अशुद्धियां हो सकती हैं
ur: یہ مضمون AI کے ذریعے ترجمہ کیا گیا ہے اور اس میں غلطیاں ہو سکتی ہیں

# translation_warning_en
source: This article is translated by AI and may contain inaccuracies
bn: এই নিবন্ধটি AI দ্বারা অনুবাদ করা হয়েছে এবং অনির্ভুলতা থাকতে পারে
fa: این مقاله توسط هوش مصنوعی ترجمه شده و ممکن است دقیق نباشد
hi: यह लेख AI द्वारा अनुवादित है और इसमें अशुद्धियां हो सकती हैं

# translation_warning_hi
source: यह लेख AI द्वारा अनुवादित है और इसमें अशुद्धियां हो सकती हैं
bn: এই নিবন্ধটি AI দ্বারা অনুবাদ করা হয়েছে এবং অনির্ভুলতা থাকতে পারে
fa: این مقاله توسط هوش مصنوعی ترجمه شده و ممکن است دقیق نباشد

# translation_warning_es
source: Este artículo está traducido por IA y puede contener inexactitudes
bn: এই নিবন্ধটি AI দ্বারা অনুবাদ করা হয়েছে এবং অনির্ভুলতা থাকতে পারে
fa: این مقاله توسط هوش مصنوعی ترجمه شده و ممکن است دقیق نباشد
hi: यह लेख AI द्वारा अनुवादित है और इसमें अशुद्धियां हो सकती हैं

# no_more_results
source: No more content
bn: আর কোন ফলাফল নেই
fa: نتایج بیشتری وجود ندارد
hi: और कोई परिणाम नहीं

# notification_channel_description
source: Boycott App Notifications
bn: Boycott নোটিফিকেশন
fa: اعلان‌های Boycott
hi: Boycott सूचनाएं
ur: Boycott نوٹیفیکیشنز

# language_chinese
source: Chinese
bn: 中文
fa: 中文
hi: 中文
ur: چینی

# language_japanese
source: Japanese
bn: 日本語
fa: 日本語
hi: 日本語
ur: جاپانی

# language_korean
source: Korean
bn: 한국어
fa: 한국어
hi: 한국어
ur: کوریائی

# language_russian
source: Russian
bn: Русский
fa: Русский
hi: Русский
ur: روسی

# back_button
source: Back
bn: পিছনে
fa: بازگشت
hi: वापस
ur: واپس

# flash_on
source: Turn Off Flashlight
bn: ফ্ল্যাশ বন্ধ করুন
fa: خاموش کردن فلش
hi: फ्लैश बंद करें
ur: فلیش بند کریں

# flash_off
source: Turn On Flashlight
bn: ফ্ল্যাশ চালু করুন
fa: روشن کردن فلش
hi: फ्लैश चालू करें
ur: فلیش آن کریں

# switch_to_back_camera
source: Switch to Rear Camera
bn: পিছনের ক্যামেরায় স্যুইচ করুন
fa: تغییر به دوربین پشت
hi: पिछले कैमरे पर स्विच करें
ur: پچھلے کیمرے پر سوئچ کریں

source: Switch to Front Camera
bn: সামনের ক্যামেরায় স্যুইচ করুন
fa: تغییر به دوربین جلو
hi: सामने के कैमरे पर स्विच करें
ur: سامنے والے کیمرے پر سوئچ کریں

# camera_switch_to_logo
source: Switch to Logo Detection Mode
bn: লোগো সনাক্তকরণ মোডে স্যুইচ করুন
fa: تغییر به حالت تشخیص لوگو
hi: लोगो पहचान मोड पर स्विच करें
ur: لوگو شناخت موڈ پر سوئچ کریں

# camera_switch_to_barcode
source: Switch to Barcode Scanning Mode
bn: বারকোড স্ক্যান মোডে স্যুইচ করুন
fa: تغییر به حالت اسکن بارکد
hi: बारकोड स्कैन मोड पर स्विच करें
ur: بارکوڈ اسکین موڈ پر سوئچ کریں

# camera_scan_result
source: Scan Result
bn: স্ক্যান ফলাফল
fa: نتیجه اسکن
hi: स्कैन परिणाम
ur: اسکین کا نتیجہ

# camera_confirm
source: Confirm
bn: নিশ্চিত করুন
fa: تایید
hi: पुष्टि करें
ur: تصدیق کریں

# camera_barcode_result
source: Barcode: %1$s
bn: কোড: %@
fa: کد: %@
hi: कोड: %@
ur: بارکوڈ: %@

# camera_barcode_error
source: Barcode Scanning Failed
bn: স্ক্যান ব্যর্থ
fa: خطا در اسکن
hi: स्कैन विफल
ur: اسکین ناکام

# camera_back
source: Back
bn: পিছনে
fa: بازگشت
hi: वापस
ur: واپس

# camera_flash
source: Flashlight
bn: ফ্ল্যাশ
fa: فلش
hi: फ्लैश
ur: فلیش

# camera_switch
source: Switch Camera
bn: ক্যামেরা পরিবর্তন
fa: تغییر دوربین
hi: कैमरा बदलें
ur: کیمرہ تبدیل کریں

# camera_take_photo
source: Take Photo
bn: ছবি তুলুন
fa: عکس گرفتن
hi: फोटो लें
ur: تصویر لیں

# camera_scan
source: Scan
bn: স্ক্যান
fa: اسکن
hi: स्कैन
ur: اسکین

# camera_pick_gallery
source: Select Image from Gallery
bn: গ্যালারি থেকে নির্বাচন করুন
fa: انتخاب از گالری
hi: गैलरी से चुनें
ur: گیلری سے منتخب کریں

# camera_scan_gallery
source: Scan from Gallery
bn: গ্যালারি থেকে স্ক্যান করুন
fa: اسکن از گالری
hi: गैलरी से स्कैन करें
ur: گیلری سے اسکین کریں

# camera_retake
source: Retake
bn: পুনরায় তুলুন
fa: عکس مجدد
hi: पुनः लें
ur: دوبارہ لیں

# gallery_button
source: Select Image from Gallery
bn: গ্যালারি থেকে নির্বাচন করুন
fa: انتخاب از گالری
hi: गैलरी से चुनें
ur: گیلری سے منتخب کریں

# scan_gallery_button
source: Scan from Gallery
bn: গ্যালারি থেকে স্ক্যান করুন
fa: اسکن از گالری
hi: गैलरी से स्कैन करें
ur: گیلری سے اسکین کریں

# camera_error
source: Error
bn: ত্রুটি
fa: خطا
hi: त्रुटि
ur: خرابی

# camera_close
source: Close
bn: বন্ধ করুন
fa: بستن
hi: बंद करें
ur: بند کریں

# camera_detection_result
source: Detection Result
bn: সনাক্তকরণ ফলাফল
fa: نتیجه تشخیص
hi: पहचान परिणाम
ur: شناخت کا نتیجہ

# brand_detail_title
source: Brand Details
bn: ব্র্যান্ড বিস্তারিত
fa: جزئیات برند
hi: ब्रांड विवरण
ur: برانڈ کی تفصیلات

# brand_boycott
source: Boycott
bn: বয়কট
fa: تحریم
hi: बहिष्कार
ur: بائیکاٹ

# brand_support
source: Support
bn: সমর্থন
fa: حمایت
hi: समर्थन
ur: حمایت

# brand_neutral
source: Neutral
bn: নিরপেক্ষ
fa: خنثی
hi: तटस्थ
ur: غیر جانبدار

# brand_search_query
source: Search Term: %1$s
bn: অনুসন্ধান: %@
fa: جستجو: %@
hi: खोज: %@
ur: تلاش: %@

# brand_not_found
source: No Relevant Brands Found
bn: কোন ব্র্যান্ড পাওয়া যায়নি
fa: برندی یافت نشد
hi: कोई ब्रांड नहीं मिला
ur: کوئی برانڈ نہیں ملا

# brand_search_results
source: Search Results
bn: অনুসন্ধান ফলাফল
fa: نتایج جستجو
hi: खोज परिणाम
ur: تلاش کے نتائج

source: Camera Not Enabled
bn: ক্যামেরা সক্রিয় নয়
fa: دوربین فعال نیست
hi: कैमरा सक्षम नहीं है
ur: کیمرہ فعال نہیں ہے

# photo_library_permission_required
source: Please allow access to Photo Library in Settings
bn: সেটিংসে ফটো লাইব্রেরি অ্যাক্সেস অনুমতি দিন
fa: لطفاً دسترسی به کتابخانه عکس را در تنظیمات فعال کنید
hi: कृपया सेटिंग्स में फोटो लाइब्रेरी तक पहुंच की अनुमति दें
ur: براہ کرم ترتیبات میں فوٹو لائبریری تک رسائی کی اجازت دیں

# camera_permission_required
source: Please allow access to Camera in Settings
bn: সেটিংসে ক্যামেরা অ্যাক্সেস অনুমতি দিন
fa: لطفاً دسترسی به دوربین را در تنظیمات فعال کنید
hi: कृपया सेटिंग्स में कैमरा तक पहुंच की अनुमति दें
ur: براہ کرم ترتیبات میں کیمرہ تک رسائی کی اجازت دیں

source: Camera Not Available
bn: ক্যামেরা উপলব্ধ নয়
fa: دوربین در دسترس نیست
hi: कैमरा उपलब्ध नहीं है
ur: کیمرہ دستیاب نہیں ہے

# camera_init_failed
source: Camera initialization failed: %@
bn: ক্যামেরা আরম্ভ ব্যর্থ: %@
fa: راه‌اندازی دوربین ناموفق بود: %@
hi: कैमरा प्रारंभ करने में विफल: %@
ur: کیمرہ شروع کرنے میں ناکام: %@

# torch_not_supported
source: Device does not support flash
bn: ডিভাইস ফ্ল্যাশ সমর্থন করে না
fa: دستگاه از فلش پشتیبانی نمی‌کند
hi: डिवाइस फ्लैश का समर्थन नहीं करता
ur: آلہ فلیش کی حمایت نہیں کرتا

# torch_control_failed
source: Flash control failed
bn: ফ্ল্যাশ নিয়ন্ত্রণ ব্যর্থ
fa: کنترل فلش ناموفق بود
hi: फ्लैश नियंत्रण विफल
ur: فلیش کنٹرول ناکام

source: Image recognition failed: %@
bn: ছবি শনাক্তকরণ ব্যর্থ: %@
fa: تشخیص تصویر ناموفق بود: %@
hi: छवि पहचान विफल: %@
ur: تصویر کی شناخت ناکام: %@

source: Barcode processing failed: %@
bn: বারকোড প্রক্রিয়াকরণ ব্যর্থ: %@
fa: پردازش بارکد ناموفق بود: %@
hi: बारकोड प्रसंस्करण विफल: %@
ur: بارکوڈ پروسیسنگ ناکام: %@

# settings_title
source: Settings
ur: ترتیبات

# language_english
source: English
ur: انگریزی
